# Задание 1
# Напишите программу, которая получает на вход строку и выводит:

# - количество символов, содержащихся в тексте;
# - True или False в зависимости от того, являются ли все символы буквами и цифрами


# Задание 2
# Напишите программу, которая получает на вход слово и выводит True, если слово является палиндромом, или False в противном случае. 
# Примечание: для сравнения в Python используется оператор ==.

# Задание 3
# Напишите программу, которая получает строку с именем, отчеством и фамилией, написанными в произвольном регистре, и выводит данные в правильном формате. 
# Например, строка алеКСандр СЕРГЕЕВИЧ ПушкиН должна быть преобразована в Александр Сергеевич Пушкин.


# Задание 4
# Имеется строка 12361573928167047230472012.
# Напишите программу, которая преобразует строку в текст один236один573928один670472304720один2.


# Задание 5
# Напишите программу, которая определяет, является ли введенная пользователем буква гласной. 
# В качестве ответа программы выводит True или False, буквы могут быть как в верхнем, так и в нижнем регистре.


# Задание 6
# Напишите программу, которая принимает строку и две подстроки start и end, а затем определяет, начинается ли строка с фрагмента start, и заканчивается ли подстрокой end. 
# Регистр не учитывать.
# Пример ввода:
# Программирование на Python - лучшее хобби
# про
# про
# Вывод:
# True
# False