'''
Задания к уроку 2. Переменные
'''

# 1. Отредактируйте код, что бы он выводил заданный текст
apple_stocks = 
print("", apple_stocks, "")
# требуемый вывод:
# Запасы яблок на складе: 356 кг.

# 2. Допишите код, что бы получить требуемый вывод
a, b = 45, 54
c = a + 1
d = c + 
print(d)
# требуемый вывод:
# 56

# 3. Создайте переменные, что бы вывести требуемый текст
print("Мой стек:", programming_lang_1, programming lang_2, programming_lang_3)
# требуемый вывод:
# Мой стек: python, javascript, php
